In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import connection

In [4]:
# Read the file
df1 = pd.read_csv('StudentsPerformance.csv')
df1.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [5]:
#Changes in dataframe made in connection.py
df2 = connection.df
df2.head()

,GENDER,ETHNICITY,PARENTAL EDUCATION LEVEL,LUNCH,TEST PREPARATION COURSE,MATH SCORE,READING SCORE,WRITING SCORE
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [16]:
df2['TEST PREPARATION COURSE'].unique()

array(['none', 'completed'], dtype=object)

### Check Data Quality

In [7]:
#Equal zero, there are no duplicate values
print(len(df2) - len(df2.drop_duplicates()), "\n")

#Counting null values in each column in df with a boolean mask
print(df2.isna().sum(axis = 0), "\n")

for column in df2.columns:
    if column == 'MATH SCORE':
        break
    else:
        print(df2.groupby(column).groups.keys())

print("\n", df2.dtypes, "\n")

for column in df2.loc[:,'MATH SCORE':'WRITING SCORE']:
    print(f"{column}'s column minimum value is:", df2[column].min(), ", and maximum is:", df2[column].max())

(rows, columns) = df2.shape

print("\nAmount of rows are:", rows)
print("Amount of columns are:", columns)

0

GENDER                      0
ETHNICITY                   0
PARENTAL EDUCATION LEVEL    0
LUNCH                       0
TEST PREPARATION COURSE     0
MATH SCORE                  0
READING SCORE               0
WRITING SCORE               0
dtype: int64

dict_keys(['female', 'male'])
dict_keys(['group A', 'group B', 'group C', 'group D', 'group E'])
dict_keys(["associate's degree", "bachelor's degree", 'high school', "master's degree", 'some college', 'some high school'])
dict_keys(['free/reduced', 'standard'])
dict_keys(['completed', 'none'])

 GENDER                      object
ETHNICITY                   object
PARENTAL EDUCATION LEVEL    object
LUNCH                       object
TEST PREPARATION COURSE     object
MATH SCORE                   int64
READING SCORE                int64
WRITING SCORE                int64
dtype: object

MATH SCORE's column minimum value is: 0 , and maximum is: 100
READING SCORE's column minimum value is: 17 , and maximum is: 100
WRITING SCORE's column minimum value is: 10 , and maximum is: 100

Amount of rows are: 1000
Amount of columns are: 8

### EDA (Exploratory Data Analysis)

In [8]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   GENDER                    1000 non-null   object
 1   ETHNICITY                 1000 non-null   object
 2   PARENTAL EDUCATION LEVEL  1000 non-null   object
 3   LUNCH                     1000 non-null   object
 4   TEST PREPARATION COURSE   1000 non-null   object
 5   MATH SCORE                1000 non-null   int64
 6   READING SCORE             1000 non-null   int64
 7   WRITING SCORE             1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [11]:
df2['LUNCH'].value_counts()

LUNCH
standard        645
free/reduced    355
Name: count, dtype: int64

In [13]:
df2.isnull().sum()

GENDER                      0
ETHNICITY                   0
PARENTAL EDUCATION LEVEL    0
LUNCH                       0
TEST PREPARATION COURSE     0
MATH SCORE                  0
READING SCORE               0
WRITING SCORE               0
dtype: int64

In [9]:
df2.describe()

       MATH SCORE  READING SCORE  WRITING SCORE
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [ ]:
# Histograma

### Data preparation

In [ ]:
# Crear variables dummy

### Visualizations